RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/cmsis/cm4/device_support/at32f45x.h
/**
  **************************************************************************
  * @file     at32f45x.h
  * @brief    at32f45x header file
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#ifndef __AT32F45x_H
#define __AT32F45x_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__CC_ARM)
 #pragma anon_unions
#endif

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup AT32F45x
  * @{
  */

/** @addtogroup Library_configuration_section
  * @{
  */

/**
  * tip: to avoid modifying this file each time you need to switch between these
  *      devices, you can define the device in your toolchain compiler preprocessor.
  */

#if !defined (AT32F455CCT7) && !defined (AT32F455CET7) && !defined (AT32F455CCU7) && \
    !defined (AT32F455CEU7) && !defined (AT32F455RCT7) && !defined (AT32F455RET7) && \
    !defined (AT32F455VCT7) && !defined (AT32F455VET7) && !defined (AT32F455ZCT7) && \
    !defined (AT32F455ZET7) && \
    !defined (AT32F456CCT7) && !defined (AT32F456CET7) && !defined (AT32F456CCU7) && \
    !defined (AT32F456CEU7) && !defined (AT32F456RCT7) && !defined (AT32F456RET7) && \
    !defined (AT32F456VCT7) && !defined (AT32F456VET7) && !defined (AT32F456ZCT7) && \
    !defined (AT32F456ZET7) && \
    !defined (AT32F457RCT7) && !defined (AT32F457RET7) && !defined (AT32F457VCT7) && \
    !defined (AT32F457VET7) && !defined (AT32F457ZCT7) && !defined (AT32F457ZET7)

    #error "Please select first the target device used in your application (in at32f45x.h file)"
#endif

#if defined (AT32F455CCT7) || defined (AT32F455CET7) || defined (AT32F455CCU7) || \
    defined (AT32F455CEU7) || defined (AT32F455RCT7) || defined (AT32F455RET7) || \
    defined (AT32F455VCT7) || defined (AT32F455VET7) || defined (AT32F455ZCT7) || \
    defined (AT32F455ZET7)

    #define AT32F455xx
#endif

#if defined (AT32F456CCT7) || defined (AT32F456CET7) || defined (AT32F456CCU7) || \
    defined (AT32F456CEU7) || defined (AT32F456RCT7) || defined (AT32F456RET7) || \
    defined (AT32F456VCT7) || defined (AT32F456VET7) || defined (AT32F456ZCT7) || \
    defined (AT32F456ZET7)

    #define AT32F456xx
#endif

#if defined (AT32F457RCT7) || defined (AT32F457RET7) || defined (AT32F457VCT7) || \
    defined (AT32F457VET7) || defined (AT32F457ZCT7) || defined (AT32F457ZET7)

    #define AT32F457xx
#endif

/**
  * define with package
  */
#if defined (AT32F455CCT7) || defined (AT32F455CET7) || defined (AT32F455CCU7) || \
    defined (AT32F455CEU7)

    #define AT32F455Cx
#endif

#if defined (AT32F455RCT7) || defined (AT32F455RET7)

    #define AT32F455Rx
#endif

#if defined (AT32F455VCT7) || defined (AT32F455VET7)

    #define AT32F455Vx
#endif

#if defined (AT32F455ZCT7) || defined (AT32F455ZET7)

    #define AT32F455Zx
#endif

#if defined (AT32F456CCT7) || defined (AT32F456CET7) || defined (AT32F456CCU7) || \
    defined (AT32F456CEU7)

    #define AT32F456Cx
#endif

#if defined (AT32F456RCT7) || defined (AT32F456RET7)

    #define AT32F456Rx
#endif

#if defined (AT32F456VCT7) || defined (AT32F456VET7)

    #define AT32F456Vx
#endif

#if defined (AT32F456ZCT7) || defined (AT32F456ZET7)

    #define AT32F456Zx
#endif

#if defined (AT32F457RCT7) || defined (AT32F457RET7)

    #define AT32F457Rx
#endif

#if defined (AT32F457VCT7) || defined (AT32F457VET7)

    #define AT32F457Vx
#endif

#if defined (AT32F457ZCT7) || defined (AT32F457ZET7)

    #define AT32F457Zx
#endif

/**
  * define with memory density
  */
#if defined (AT32F455CCT7) || defined (AT32F455CCU7) || defined (AT32F455RCT7) || \
    defined (AT32F455VCT7) || defined (AT32F455ZCT7)

    #define AT32F455xC
#endif

#if defined (AT32F455CET7) || defined (AT32F455CEU7) || defined (AT32F455RET7) || \
    defined (AT32F455VET7) || defined (AT32F455ZET7)

    #define AT32F455xE
#endif

#if defined (AT32F456CCT7) || defined (AT32F456CCU7) || defined (AT32F456RCT7) || \
    defined (AT32F456VCT7) || defined (AT32F456ZCT7)

    #define AT32F456xC
#endif

#if defined (AT32F456CET7) || defined (AT32F456CEU7) || defined (AT32F456RET7) || \
    defined (AT32F456VET7) || defined (AT32F456ZET7)

    #define AT32F456xE
#endif

#if defined (AT32F457RCT7) || defined (AT32F457VCT7) || defined (AT32F457ZCT7)

    #define AT32F457xC
#endif

#if defined (AT32F457RET7) || defined (AT32F457VET7) || defined (AT32F457ZET7)

    #define AT32F457xE
#endif

#ifndef USE_STDPERIPH_DRIVER
/**
  * @brief comment the line below if you will not use the peripherals drivers.
  * in this case, these drivers will not be included and the application code will
  * be based on direct access to peripherals registers
  */
  #ifdef _RTE_
    #include "RTE_Components.h"
    #ifdef RTE_DEVICE_STDPERIPH_FRAMEWORK
      #define USE_STDPERIPH_DRIVER
    #endif
  #endif
#endif

/**
  * @brief at32f45x standard peripheral library version number
  */
#define __AT32F45x_LIBRARY_VERSION_MAJOR    (0x02) /*!< [31:24] major version */
#define __AT32F45x_LIBRARY_VERSION_MIDDLE   (0x00) /*!< [23:16] middle version */
#define __AT32F45x_LIBRARY_VERSION_MINOR    (0x00) /*!< [15:8]  minor version */
#define __AT32F45x_LIBRARY_VERSION_RC       (0x00) /*!< [7:0]  release candidate */
#define __AT32F45x_LIBRARY_VERSION          ((__AT32F45x_LIBRARY_VERSION_MAJOR << 24)  | \
                                             (__AT32F45x_LIBRARY_VERSION_MIDDLE << 16) | \
                                             (__AT32F45x_LIBRARY_VERSION_MINOR << 8)   | \
                                             (__AT32F45x_LIBRARY_VERSION_RC))

/**
  * @}
  */

